src/cf/Enums/пбп_ТипыОтветовREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>пбп_ТипыОтветовREST</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеКорректныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНетДоступа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаНеНайдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаМетодНеПоддерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКлиентскаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОПеренаправлении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_ТипыОтветовREST/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПользовательскиеВидыОтветов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.Успешно					, 200);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаНеКорректныйЗапрос, 400);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаНеНайдено			, 404);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСлужебныеВидыОтветов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаНеАвторизован			, 401);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаНетДоступа			, 403);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаНеНайдено				, 404);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаМетодНеПоддерживается	, 405);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ОшибкаСпецификации			, 422);
	Результат.Вставить(Перечисления.пбп_ТипыОтветовREST.ВнутренняяОшибка			, 500);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
